/*************************************************************************
	> File Name: euler15.cpp
	> Author: 
	> Mail: 
	> Created Time: 2019年08月02日 星期五 15时12分41秒
 ************************************************************************/

#include<stdio.h>

int main() {
    long long a[45][45];
    for(int i = 0; i < 45; i++){
        a[i][0] = 1;
        a[i][i] = 1;
    }
    for(int i = 2; i < 45; i++) {
        for(int j = 1; j < i; j++) {
        a[i][j] = a[i-1][j] + a[i-1][j-1];
        }
    }
    printf("%lld",a[40][20]);
}

